sphere/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# Alternative decomposeParDict name:
# decompDict="-decomposeParDict system/decomposeParDict.6"
## Standard decomposeParDict name:
# unset decompDict

# copy motorbike surface from resources directory
# mkdir -p constant/triSurface

# cp -f \
#    "$FOAM_TUTORIALS"/resources/geometry/motorBike.obj.gz \
#    constant/triSurface/

runApplication surfaceFeatureExtract

runApplication blockMesh

# runApplication $decompDict decomposePar

# Using distributedTriSurfaceMesh?
if foamDictionary -entry geometry -value system/snappyHexMeshDict | \
   grep -q distributedTriSurfaceMesh
then
    echo "surfaceRedistributePar does not need to be run anymore"
    echo " - distributedTriSurfaceMesh will do on-the-fly redistribution"
fi

# runParallel $decompDict snappyHexMesh -overwrite
runApplication snappyHexMesh -overwrite
# runParallel $decompDict topoSet

#- For non-parallel running: - set the initial fields
restore0Dir

#- For parallel running: set the initial fields
#restore0Dir -processor

#runParallel $decompDict patchSummary

#runParallel $decompDict potentialFoam -writephi

#runParallel $decompDict checkMesh -writeFields '(nonOrthoAngle)' -constant

#runParallel $decompDict $(getApplication)

#runApplication reconstructParMesh -constant

#runApplication reconstructPar -latestTime

#------------------------------------------------------------------------------
